# RebarSystemDirectionNotSpecifiedError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..RebarSystemDirectionNotSpecifiedError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Major direction not specified.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarSystemDirectionNotSpecifiedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemDirectionNotSpecifiedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarSystemDirectionNotSpecifiedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace